ARM-Mbed/STM32F469_Discover_kit/STM32F469_Discover_kit.ioc
PF3.GPIO_PuPd=GPIO_NOPULL
PB8.GPIO_PuPdOD=GPIO_PULLUP
SH.FMC_A1.0=FMC_A1
PH2.Signal=FMC_SDCKE0
PI7.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
SH.FMC_SDCLK.0=FMC_SDCLK
PF14.Signal=FMC_A8
PI4.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Dma.ADC1.0.FIFOMode=DMA_FIFOMODE_DISABLE
PG9.GPIO_Mode=GPIO_MODE_AF_PP
PB10.GPIOParameters=GPIO_Label
PC12.GPIO_PuPd=GPIO_NOPULL
PA12.GPIO_PuPd=GPIO_NOPULL
PE10.GPIO_Label=D7
SH.FMC_D3_DA3.0=FMC_D3
ProjectManager.CustomerFirmwarePackage=
PF4.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PG6.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PI10.GPIO_Label=D31
PB7.GPIO_PuPd=GPIO_NOPULL
PH12.GPIOParameters=GPIO_Label
PA0/WKUP.GPIOParameters=GPIO_Label
SH.FMC_A7.ConfNb=1
PH15.Signal=FMC_D23
SH.FMC_A1.ConfNb=1
Dma.ADC1.0.Instance=DMA2_Stream0
ADC1.Rank-0\#ChannelRegularConversion=1
SH.FMC_D28.0=FMC_D28
PD9.GPIO_Label=D14
PD2.GPIO_PuPd=GPIO_NOPULL
PG9.GPIO_PuPd=GPIO_NOPULL
ADC1.IPParameters=Rank-0\#ChannelRegularConversion,master,Channel-0\#ChannelRegularConversion,SamplingTime-0\#ChannelRegularConversion,NbrOfConversionFlag,ContinuousConvMode,DMAContinuousRequests
PG9.Locked=true
PG9.Signal=USART6_RX
PA9.GPIO_Label=VBUS_FS1
PB11.GPIO_Label=STLK_TX [STLINK V2-1_U2_TX]
PD13.GPIOParameters=GPIO_Label
PD1.Signal=FMC_D3_DA3
PA11.GPIO_Label=USB_FS1_N
PE1.GPIO_PuPd=GPIO_NOPULL
PF14.GPIO_Label=A8
PD1.GPIO_PuPd=GPIO_NOPULL
PC0.Signal=FMC_SDNWE
RCC.APB1CLKDivider=RCC_HCLK_DIV4
PC11.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PF13.GPIO_Label=A7
DSIHOST_CKP.Locked=true
SH.FMC_A3.0=FMC_A3
PA11.Locked=true
SH.FMC_D31.ConfNb=1
PF2.GPIO_Mode=GPIO_MODE_AF_PP
SH.FMC_D15_DA15.0=FMC_D15
PI3.GPIO_PuPd=GPIO_NOPULL
PA9.Signal=USB_OTG_FS_VBUS
PI1.Locked=true
PE9.GPIO_Label=D6
SH.FMC_D17.0=FMC_D17
PB10.Signal=USART3_TX
PH9.GPIO_Label=D17
PI9.GPIO_Label=D30
ProjectManager.LastFirmware=true
PI2.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PF2.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PI0.GPIO_Mode=GPIO_MODE_AF_PP
PI6.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PI6.Locked=true
SH.FMC_D20.ConfNb=1
PE15.Signal=FMC_D12_DA12
PE8.Signal=FMC_D5_DA5
PI1.Signal=FMC_D25
PC11.GPIO_Mode=GPIO_MODE_AF_PP
Mcu.Pin112=VP_ADC1_TempSens_Input
Mcu.Pin113=VP_SYS_VS_Systick
RCC.EthernetFreq_Value=168000000
DSIHOST_D1P.Locked=true
PF12.Locked=true
PF11.Locked=true
PA0/WKUP.GPIO_Label=WAKEUP [B2]
Mcu.Pin110=PE13
Mcu.Pin111=PB11
PA9.Locked=true
ADC1.DMAContinuousRequests=ENABLE
PB3.GPIO_Mode=GPIO_MODE_AF_PP
PI0.Locked=true
PE7.Locked=true
SH.FMC_SDNCAS.0=FMC_SDNCAS
PG14.GPIO_Label=ARDUINO USART6_TX
ProjectManager.FreePins=false
SH.FMC_NBL1.ConfNb=1
RCC.RTCHSEDivFreq_Value=12500000
ProjectManager.UnderRoot=true
PE4.GPIO_PuPd=GPIO_NOPULL
PE13.Locked=true
PC12.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PH14.GPIO_Label=D22
SH.FMC_D7_DA7.ConfNb=1
PC8.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PC12.GPIO_Mode=GPIO_MODE_AF_PP
PG15.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PE13.GPIO_Label=D10
PE3.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PE3.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
SH.FMC_A10.ConfNb=1
ProjectManager.CompilerOptimize=6
SH.FMC_A5.0=FMC_A5
PA11.Signal=USB_OTG_FS_DM
PK3.GPIO_Label=LED_Blue
PH5.Locked=true
PF8.Locked=true
ProjectManager.ComputerToolchain=false
PF9.Signal=QUADSPI_BK1_IO1
PG8.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
Mcu.Pin109=PE15
PE2.Locked=true
PF3.Locked=true
Mcu.Pin105=PB0
Mcu.Pin106=PE7
PI4.GPIO_PuPd=GPIO_NOPULL
Mcu.Pin107=PE10
PD5.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_OD
Mcu.Pin108=PE12
PE12.GPIOParameters=GPIO_Label
SH.FMC_NBL3.0=FMC_NBL3
PB6.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
SH.FMC_D12_DA12.ConfNb=1
PD1.Locked=true
PB0.Signal=GPIO_Output
SH.FMC_D19.0=FMC_D19
PE0.GPIO_Mode=GPIO_MODE_AF_PP
PC0.Locked=true
PG15.GPIO_PuPd=GPIO_NOPULL
PD2.GPIO_Label=uSD_CMD
PF3.GPIO_Mode=GPIO_MODE_AF_PP
PG7.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PH2.GPIO_Label=SDCKE0 [MT48LC4M32B2B5-6A_CKE]
Mcu.Pin101=PB10
Mcu.Pin102=PH8
Mcu.Pin103=PH10
Mcu.Pin104=PA3
PF2.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
Mcu.Pin100=PE14
SH.S_TIM4_CH2.ConfNb=1
RCC.CortexFreq_Value=168000000
SH.FMC_A2.ConfNb=1
PG6.Signal=GPIO_Output
PH14.Locked=true
PI10.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
Mcu.UserName=STM32F469NIHx
PB6.GPIO_Mode=GPIO_MODE_AF_PP
PD9.GPIOParameters=GPIO_Label
DSIHOST_D1P.GPIOParameters=GPIO_Label
PF4.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PC10.Locked=true
PG6.Locked=true
PC10.Signal=SDIO_D2
PF4.GPIO_PuPd=GPIO_NOPULL
SH.FMC_NBL0.0=FMC_NBL0
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-LL-true,2-MX_DMA_Init-DMA-false-LL-true,3-SystemClock_Config-RCC-false-LL-false,4-MX_ADC1_Init-ADC1-false-LL-true
PC0.GPIOParameters=GPIO_Label
PI4.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PC0.GPIO_Label=SDNWE [MT48LC4M32B2B5-6A_WE]
SH.FMC_D6_DA6.0=FMC_D6
PC9.Locked=true
PA0/WKUP.Signal=SYS_WKUP
PB0.GPIO_Label=EXT_RESET
RCC.PLLI2SRCLKFreq_Value=192000000
PA11.GPIO_PuPd=GPIO_NOPULL
PH5.GPIO_Label=I2C2_SDA [CS43L22_SDA]
PI5.GPIO_Label=FMC_NBL3 [MT48LC4M32B2B5-6A_DQM3]
PB11.Signal=USART3_RX
PI0.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PG8.GPIO_Mode=GPIO_MODE_AF_PP
PE5.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
ProjectManager.StackSize=0x400
PA12.Locked=true
SH.FMC_A7.0=FMC_A7
PA12.Signal=USB_OTG_FS_DP
PH4.GPIOParameters=GPIO_Speed,GPIO_PuPdOD,GPIO_Label,GPIO_Mode
Mcu.UserConstants=
PE5.GPIO_PuPd=GPIO_NOPULL
PI1.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PF5.Locked=true
Mcu.ThirdPartyNb=0
PE1.GPIO_Mode=GPIO_MODE_AF_PP
PH0/OSC_IN.Mode=HSE-External-Oscillator
RCC.HCLKFreq_Value=168000000
Mcu.IPNb=5
PH5.GPIO_Mode=GPIO_MODE_AF_OD
PF11.GPIO_Label=SDNMT48LC4M32B2B5-6A_RAS]RAS [
PA0/WKUP.Locked=true
PF2.GPIO_PuPd=GPIO_NOPULL
PD8.GPIOParameters=GPIO_Label
PF12.Signal=FMC_A6
Mcu.Pin6=PB8
PH15.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
Mcu.Pin7=PB3
NVIC.DMA2_Stream0_IRQn=true\:0\:0\:false\:false\:true\:false\:true
Mcu.Pin8=PC12
Mcu.Pin9=PA14
RCC.VCOSAIOutputFreq_Value=384000000
PC9.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PJ2.Locked=true
SH.FMC_A10.0=FMC_A10
RCC.AHBFreq_Value=168000000
Mcu.Pin0=PE4
Mcu.Pin1=PE3
Mcu.Pin2=PE2
Mcu.Pin3=PG14
PK3.Locked=true
Mcu.Pin4=PE1
PD10.GPIOParameters=GPIO_Label
Mcu.Pin5=PE0
SH.FMC_D8_DA8.0=FMC_D8
SH.FMC_D2_DA2.0=FMC_D2
PE13.Signal=FMC_D10_DA10
PF7.GPIO_Label=QSPI_BK1_IO2 [N25Q128A13EF840F_DQ2]
PI1.GPIO_PuPd=GPIO_NOPULL
PE0.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PI5.Locked=true
PI5.Signal=FMC_NBL3
PE4.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PI0.Signal=FMC_D24
File.Version=6
PA10.GPIO_Label=USB_FS1_ID
PB3.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
SH.FMC_D5_DA5.ConfNb=1
PH3.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
SH.FMC_D2_DA2.ConfNb=1
PB8.Locked=true
SH.FMC_SDNRAS.0=FMC_SDNRAS
PE4.Signal=SAI1_FS_A
PH1/OSC_OUT.Mode=HSE-External-Oscillator
Dma.RequestsNb=1
ProjectManager.ProjectName=STM32F469_Discover_kit
DSIHOST_D1N.GPIOParameters=GPIO_Label
SH.FMC_D0_DA0.0=FMC_D0
PC14/OSC32_IN.Signal=RCC_OSC32_IN
PD14.Locked=true
PF5.GPIO_Label=A5
SH.GPXTI5.ConfNb=1
PF3.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
SH.FMC_A9.0=FMC_A9
DSIHOST_D0N.Locked=true
SH.FMC_D4_DA4.0=FMC_D4
PE0.GPIO_Label=FMC_NBL0 [ MT48LC4M32B2B5-6A_DQM0]
PH3.GPIO_Label=SDNE0 [MT48LC4M32B2B5-6A_CS]
PF5.Signal=FMC_A5
PB9.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
SH.FMC_D19.ConfNb=1
SH.FMC_D30.0=FMC_D30
PF0.Signal=FMC_A0
PI2.GPIO_Label=D26
SH.FMC_NBL0.ConfNb=1
RCC.SAIBFreq_Value=96000000
PF0.GPIO_Mode=GPIO_MODE_AF_PP
PB3.Locked=true
PH14.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
PB3.GPIO_Label=I2S3_CK
SH.GPXTI5.0=GPIO_EXTI5
PE8.GPIOParameters=GPIO_Label
SH.FMC_A9.ConfNb=1
PH15.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PB9.GPIO_Label=I2C1_SDA
PC10.GPIO_Label=uSD_D2
PH11.Signal=FMC_D19
ProjectManager.NoMain=false
PG1.Signal=FMC_A11
PG1.Locked=true
RCC.PLLRFreq_Value=168000000
PH5.GPIO_PuPdOD=GPIO_PULLUP
SH.FMC_SDCLK.ConfNb=1
PE5.GPIO_Mode=GPIO_MODE_AF_PP
PI10.Signal=FMC_D31
PD5.Signal=GPIO_Output
PA10.GPIO_Mode=GPIO_MODE_AF_PP
PE9.GPIOParameters=GPIO_Label
RCC.DSITXEscFreq_Value=15625000
PH13.GPIO_Label=D21
PC8.GPIO_Label=uSD_D0
PC12.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,GPIO_Mode
SH.FMC_D21.0=FMC_D21
PH8.GPIO_Label=D16
PE4.GPIO_Mode=GPIO_MODE_AF_PP
SH.FMC_NBL3.ConfNb=1
PE15.GPIO_Label=D12
PH4.Signal=I2C2_SCL
ProjectManager.TargetToolchain=STM32CubeIDE
PE7.GPIOParameters=GPIO_Label
Dma.ADC1.0.Mode=DMA_CIRCULAR
SH.FMC_D1_DA1.ConfNb=1
PF15.Locked=true
PE4.Locked=true
PC11.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PF2.Signal=FMC_A2
ProjectManager.RegisterCallBack=
PF5.GPIOParameters=GPIO_Label
PH2.GPIOParameters=GPIO_Label
PH11.Locked=true
SH.FMC_D28.ConfNb=1
DSIHOST_D0P.GPIOParameters=GPIO_Label
PE11.Signal=FMC_D8_DA8
PI10.GPIO_Mode=GPIO_MODE_AF_PP
PG9.GPIO_Label=USART6_RX
PG14.Signal=USART6_TX
PI5.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PK3.GPIO_PuPd=GPIO_NOPULL
PG1.GPIO_Label=A11
PB9.GPIO_Mode=GPIO_MODE_AF_OD
PA12.GPIO_Mode=GPIO_MODE_AF_PP
Dma.ADC1.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode
PH0/OSC_IN.Signal=RCC_OSC_IN
PG7.GPIO_Speed=GPIO_SPEED_FREQ_LOW
RCC.APB2Freq_Value=42000000
SH.FMC_D13_DA13.ConfNb=1
PI3.Locked=true
PD4.GPIO_Label=LED_Orange
PF10.Signal=QUADSPI_CLK
PH3.GPIO_Mode=GPIO_MODE_AF_PP
PF1.GPIO_PuPd=GPIO_NOPULL
PI7.GPIO_Label=D29
PE1.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PF15.Signal=FMC_A9
PD14.GPIO_Label=D0
PF0.Locked=true
PE11.Locked=true
Mcu.Name=STM32F469NIHx
SH.FMC_D23.ConfNb=1
PA13.GPIO_Label=SWDIO
DSIHOST_D0N.GPIO_Label=DSI_D0_N
PD14.Signal=FMC_D0_DA0
PB3.Signal=I2S3_CK
PH4.GPIO_Mode=GPIO_MODE_AF_OD
PF0.GPIO_PuPd=GPIO_NOPULL
SH.FMC_D23.0=FMC_D23
PA14.Signal=SYS_JTCK-SWCLK
DSIHOST_D0N.Signal=DSIHOST_D0N
PF6.GPIOParameters=GPIO_Label
PB9.GPIO_PuPdOD=GPIO_PULLUP
PH2.Locked=true
ADC1.NbrOfConversionFlag=1
PK3.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PB8.Signal=I2C1_SCL
PE3.GPIO_Label=SPKR/HP [CS43L22_SPKR/HP]
PC9.Signal=SDIO_D1
PA11.GPIO_Mode=GPIO_MODE_AF_PP
PB8.GPIO_Mode=GPIO_MODE_AF_OD
RCC.APB1Freq_Value=42000000
PB11.Locked=true
ProjectManager.DeviceId=STM32F469NIHx
ProjectManager.LibraryCopy=1
PF2.GPIO_Label=A2
isbadioc=false
